In [2]:
import pandas as pd
import glob

In [8]:
df = pd.concat([pd.read_csv(f) for f in glob.glob("../data/*.csv")], ignore_index=True)
df.head(2)

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price,remaining_lease,address,timestamp,year
0,1,ANG MO KIO,3 ROOM,174,ANG MO KIO AVE 4,07 TO 09,60.0,Improved,1986,255000.0,70,174 ANG MO KIO AVE 4,2015-01-01,2015.0
1,1,ANG MO KIO,3 ROOM,541,ANG MO KIO AVE 10,01 TO 03,68.0,New Generation,1981,275000.0,65,541 ANG MO KIO AVE 10,2015-01-01,2015.0

In [9]:
df.shape

(743787, 14)

In [10]:
df.isnull().sum()

month                       0
town                        0
flat_type                   0
block                       0
street_name                 0
storey_range                0
floor_area_sqm              0
flat_model                  0
lease_commence_date         0
resale_price                0
remaining_lease        339399
address                541593
timestamp              541593
year                   541593
dtype: int64

In [11]:
df = df.dropna()

In [12]:
df.isnull().sum()

month                  0
town                   0
flat_type              0
block                  0
street_name            0
storey_range           0
floor_area_sqm         0
flat_model             0
lease_commence_date    0
resale_price           0
remaining_lease        0
address                0
timestamp              0
year                   0
dtype: int64

In [13]:
df['town'].unique()

array(['ANG MO KIO', 'BEDOK', 'BISHAN', 'BUKIT BATOK', 'BUKIT MERAH',
       'BUKIT PANJANG', 'BUKIT TIMAH', 'CENTRAL AREA', 'CHOA CHU KANG',
       'CLEMENTI', 'GEYLANG', 'HOUGANG', 'JURONG EAST', 'JURONG WEST',
       'KALLANG/WHAMPOA', 'MARINE PARADE', 'PASIR RIS', 'PUNGGOL',
       'QUEENSTOWN', 'SEMBAWANG', 'SENGKANG', 'SERANGOON', 'TAMPINES',
       'TOA PAYOH', 'WOODLANDS', 'YISHUN'], dtype=object)

In [14]:
df['flat_type'].unique()

array(['3 ROOM', '4 ROOM', '5 ROOM', '2 ROOM', 'EXECUTIVE', '1 ROOM',
       'MULTI-GENERATION'], dtype=object)

In [15]:
# df['block'].value_counts()
# df['block'].nunique()

In [16]:
# df['street_name'].nunique()

In [17]:
# df['storey_range'].unique()

In [19]:
df['address'] = df['block'] +" " + df['street_name']
df.head(2)

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price,remaining_lease,address,timestamp,year
0,1,ANG MO KIO,3 ROOM,174,ANG MO KIO AVE 4,07 TO 09,60.0,Improved,1986,255000.0,70,174 ANG MO KIO AVE 4,2015-01-01,2015.0
1,1,ANG MO KIO,3 ROOM,541,ANG MO KIO AVE 10,01 TO 03,68.0,New Generation,1981,275000.0,65,541 ANG MO KIO AVE 10,2015-01-01,2015.0

In [44]:
df.dtypes

month                   object
town                    object
flat_type               object
block                   object
street_name             object
storey_range            object
floor_area_sqm         float64
flat_model              object
lease_commence_date      int64
resale_price           float64
remaining_lease         object
address                 object
dtype: object

In [20]:
df['timestamp'] = pd.to_datetime(df['month'])

In [49]:
df['month'] = df['timestamp'].dt.month
df['year'] = df['timestamp'].dt.year

In [21]:
df.head(2)

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price,remaining_lease,address,timestamp,year
0,1,ANG MO KIO,3 ROOM,174,ANG MO KIO AVE 4,07 TO 09,60.0,Improved,1986,255000.0,70,174 ANG MO KIO AVE 4,1970-01-01 00:00:00.000000001,2015.0
1,1,ANG MO KIO,3 ROOM,541,ANG MO KIO AVE 10,01 TO 03,68.0,New Generation,1981,275000.0,65,541 ANG MO KIO AVE 10,1970-01-01 00:00:00.000000001,2015.0

In [53]:
df.to_csv('../data/final.csv', index= False)

In [23]:
new_df = pd.read_csv('../data/final.csv')
new_df.head(2)

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price,remaining_lease,address,timestamp,year
0,1,ANG MO KIO,3 ROOM,174,ANG MO KIO AVE 4,07 TO 09,60.0,Improved,1986,255000.0,70,174 ANG MO KIO AVE 4,2015-01-01,2015
1,1,ANG MO KIO,3 ROOM,541,ANG MO KIO AVE 10,01 TO 03,68.0,New Generation,1981,275000.0,65,541 ANG MO KIO AVE 10,2015-01-01,2015

In [24]:
new_df.dtypes

month                    int64
town                    object
flat_type               object
block                   object
street_name             object
storey_range            object
floor_area_sqm         float64
flat_model              object
lease_commence_date      int64
resale_price           float64
remaining_lease         object
address                 object
timestamp               object
year                     int64
dtype: object

In [58]:
new_df.isnull().sum()

month                  0
town                   0
flat_type              0
block                  0
street_name            0
storey_range           0
floor_area_sqm         0
flat_model             0
lease_commence_date    0
resale_price           0
remaining_lease        0
address                0
timestamp              0
year                   0
dtype: int64

In [26]:
import statistics
def get_median(x):
    split_list = x.split(' TO ')
    float_list = [float(i) for i in split_list]
    median = statistics.median(float_list)
    return median

new_df['story_median'] = new_df['storey_range'].apply(lambda x:get_median(x))
new_df.head(2)

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price,remaining_lease,address,timestamp,year,story_median
0,1,ANG MO KIO,3 ROOM,174,ANG MO KIO AVE 4,07 TO 09,60.0,Improved,1986,255000.0,70,174 ANG MO KIO AVE 4,2015-01-01,2015,8.0
1,1,ANG MO KIO,3 ROOM,541,ANG MO KIO AVE 10,01 TO 03,68.0,New Generation,1981,275000.0,65,541 ANG MO KIO AVE 10,2015-01-01,2015,2.0

In [27]:
coordinates_df = pd.read_csv('../data/df_coordinates.csv')
coordinates_df.head(2)

,latitude,longitude,blk_no,road_name,postal_code,address,cbd_dist,min_dist_mrt
0,1.362005,103.853880,406,ANG MO KIO AVENUE 10,560406,406 ANG MO KIO AVE 10,8740.633473,999.941595
1,1.370966,103.838202,108,ANG MO KIO AVENUE 4,560108,108 ANG MO KIO AVE 4,9835.486576,1268.958162

In [28]:
df_new = coordinates_df.merge(new_df, on='address', how='outer')
df_new.head(2)

,latitude,longitude,blk_no,road_name,postal_code,address,cbd_dist,min_dist_mrt,month,town,...,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price,remaining_lease,timestamp,year,story_median
0,1.294801,103.854467,1,BEACH ROAD,189673,1 BEACH RD,1351.713661,143.728945,1,KALLANG/WHAMPOA,...,BEACH RD,04 TO 06,74.0,Improved,1979,388000.0,63,2015-01-01,2015,5.0
1,1.294801,103.854467,1,BEACH ROAD,189673,1 BEACH RD,1351.713661,143.728945,3,KALLANG/WHAMPOA,...,BEACH RD,07 TO 09,68.0,Improved,1979,350000.0,62,2016-03-01,2016,8.0

In [29]:
df_new.dropna(inplace=True)

In [30]:
df_new['resale_price'] = df_new['resale_price'].astype('float')
df_new['floor_area_sqm'] = df_new['floor_area_sqm'].astype('float')
df_new['lease_commence_date'] = df_new['lease_commence_date'].astype('int64')
df_new['lease_remain_years'] = 99 - (2023 - df_new['lease_commence_date'])

In [31]:
df_new.head(2)

,latitude,longitude,blk_no,road_name,postal_code,address,cbd_dist,min_dist_mrt,month,town,...,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price,remaining_lease,timestamp,year,story_median,lease_remain_years
0,1.294801,103.854467,1,BEACH ROAD,189673,1 BEACH RD,1351.713661,143.728945,1,KALLANG/WHAMPOA,...,04 TO 06,74.0,Improved,1979,388000.0,63,2015-01-01,2015,5.0,55
1,1.294801,103.854467,1,BEACH ROAD,189673,1 BEACH RD,1351.713661,143.728945,3,KALLANG/WHAMPOA,...,07 TO 09,68.0,Improved,1979,350000.0,62,2016-03-01,2016,8.0,55

In [33]:
df_new.to_csv('../data/combined.csv', index = False)